
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |        8 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                            |
|:--------:|:-------------------------------------------------------------------------------------|
|    🟢    | `module.repos["terraform-aws-pmm-ecs"].github_branch_default.main`                   |
|    🟢    | `module.repos["terraform-aws-pmm-ecs"].github_branch_protection.main[0]`             |
|    🟢    | `module.repos["terraform-aws-pmm-ecs"].github_repository.repo`                       |
|    🟢    | `module.repos["terraform-aws-pmm-ecs"].github_repository_file.renovate-json[0]`      |
|    🟢    | `module.repos["terraform-aws-pmm-ecs"].github_repository_file.vuln_scanner_workflow` |
|    🟢    | `module.repos["terraform-aws-pmm-ecs"].github_repository_ruleset.main[0]`            |
|    🟢    | `module.repos["terraform-aws-pmm-ecs"].github_team_repository.admin`                 |
|    🟢    | `module.repos["terraform-aws-pmm-ecs"].github_team_repository.dev`                   |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repos["terraform-aws-pmm-ecs"].github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "terraform-aws-pmm-ecs"
    }

  # module.repos["terraform-aws-pmm-ecs"].github_branch_protection.main[0] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOB0VVB84AD4Ir",
            ]
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }
    }

  # module.repos["terraform-aws-pmm-ecs"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Terraform module for deploying Percona Monitoring and Management (PMM) server on AWS ECS with persistent EFS storage, automatic SSL, and RDS PostgreSQL monitoring support. "
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "terraform-aws-pmm-ecs"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.repos["terraform-aws-pmm-ecs"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Configure renovate"
      + commit_sha                   = (known after apply)
      + content                      = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                         = "renovate.json"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-pmm-ecs"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-pmm-ecs"].github_repository_file.vuln_scanner_workflow will be created
  + resource "github_repository_file" "vuln_scanner_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Update vuln-scanner-pr.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            ---
            name: OSV-Scanner PR Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              # Required to upload SARIF file to CodeQL. See: https://github.com/github/codeql-action/issues/2117
              actions: read
              # Require writing security events to upload SARIF file to security tab
              security-events: write
              # Only need to read contents
              contents: read
            
            jobs:
              vulnerability-check:
                uses: "google/osv-scanner-action/.github/workflows/osv-scanner-reusable.yml@v2.2.4"
                with:
                  scan-args: --config osv-scanner.toml
                  upload-sarif: false
        EOT
      + file                         = "./.github/workflows/vuln-scanner-pr.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-pmm-ecs"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-pmm-ecs"].github_repository_ruleset.main[0] will be created
  + resource "github_repository_ruleset" "main" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Main Branch Protection"
      + node_id     = (known after apply)
      + repository  = "terraform-aws-pmm-ecs"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 1016363
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }
      + bypass_actors {
          + actor_id    = 14268696
          + actor_type  = "Team"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = true
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }

          + required_status_checks {
              + do_not_enforce_on_create             = false
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "vulnerability-check / osv-scan"
                  + integration_id = 0
                }
            }
        }
    }

  # module.repos["terraform-aws-pmm-ecs"].github_team_repository.admin will be created
  + resource "github_team_repository" "admin" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "terraform-aws-pmm-ecs"
      + team_id    = "14268696"
    }

  # module.repos["terraform-aws-pmm-ecs"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "terraform-aws-pmm-ecs"
      + team_id    = "7332815"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAiYWRkIjogOCwgImNoYW5nZSI6IDAsICJkZXN0cm95IjogMH19
```
</details>